export const weatherIdList = [
  'N09140104', // '서울'
  'N11720330', // '인천'
  'N02113128', // '수원'
  'N06110101', // '대구'
  'N07110101', // '대전'
  'N08110580', // '부산'
  'N14130116', // '제주'
  'N12130127', // '여수'
  'N04170690', // '안동'
  'N13113135', // '전주'
  'N05110101', // '광주'
  'N16111120', // '청주'
  'N12110152', // '목포'
  'N10110101', // '울산'
  'N01110675', // '춘천'
  'N01150615', // '강릉'
  'N04940320', // '울릉/독도'
];

export const weatherCode = {
  1: {
    icon: '☀️',
    text: '맑음',
  },
  5: {
    icon: '🌤',
    text: '구름많음',
  },
  7: {
    icon: '☁️',
    text: '흐림',
  },
  9: {
    icon: '🌧',
    text: '흐리고 비',
  },
  15: {
    icon: '⛈',
    text: '흐리고 가끔 소나기',
  },
  22: {
    icon: '🌦',
    text: '흐리고 가끔 비',
  },
};
